app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
---
	def index
		post_id = params[:post_id]
		@post = Post.find(post_id)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
---
	def new
		post_id = params[:post_id]
		@post= Post.find(post_id)