app/controllers/posts_controller.rb

 	def show
		id = params[:id]
		@post = Post.find(id)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]