app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
def index
	# @tags = Tag.all
	# render :index
	@all_tags = Tag.all.select do |tag|